[
  {
    "section": "introduction",
    "chunk_id": "introduction_0",
    "text": "The Group's official Vision is: To be a highly reliable regional professional firm. The Group's official Mission is: To leverage technology and the UHY international brand to improve the gross margin; To venture into financial services to enhance the Group's income stream."
  },
  {
    "section": "employment_contract",
    "chunk_id": "employment_contract_0",
    "text": "Appointment: For every new employee, they will receive an appointment letter from the HR department before starting their duties."
  },
  {
    "section": "employment_contract",
    "chunk_id": "employment_contract_1",
    "text": "Employee Personal Information: Employees should provide updated personal information for record purposes."
  },
  {
    "section": "employment_contract",
    "chunk_id": "employment_contract_2",
    "text": "Pre-employment medical check-up: All new employees must undergo a medical check-up before the letter of employment is issued."
  },
  {
    "section": "employment_contract",
    "chunk_id": "employment_contract_3",
    "text": "Orientation Program: Conducted by the HR Department for all new employees to help them understand the Group's policies and procedures."
  },
  {
    "section": "employment_contract",
    "chunk_id": "employment_contract_4",
    "text": "Departmental Orientation: Conducted by the Head of SBU for the new Employee."
  },
  {
    "section": "employment_contract",
    "chunk_id": "employment_contract_5",
    "text": "Probation and Confirmation: All permanent employees are required to serve a 6-month probation period from the date of appointment. The probationary period may be extended for up to another 6 months if the performance does not meet the Group's standards. The Group can terminate an employee if they do not fulfill expectations during or at the end of the probation period."
  },
  {
    "section": "work_hours",
    "chunk_id": "work_hours_0",
    "text": "Normal working hours are Monday to Friday, 8:30 am to 5:30 pm. Lunch break is from 1:00 pm to 2:00 pm."
  },
  {
    "section": "overtime",
    "chunk_id": "overtime_0_allowance",
    "text": "Overtime Allowance: For employees with a salary of RM1,500.00 or less per month, they are entitled to claim overtime allowance. The overtime rate is one and a half (1 1/2) times the hourly pay. For the first hour, payment is calculated in units of 30 minutes, rounded to the nearest 30 minutes."
  },
  {
    "section": "overtime",
    "chunk_id": "overtime_0_lieu",
    "text": "Time-Off-In-Lieu: This is applicable to employees earning RM1,501.00 and above."
  },
  {
    "section": "overtime",
    "chunk_id": "overtime_1",
    "text": "General claim processes: Employees can claim a meal allowance if they meet the overtime work conditions. Overtime claims must be submitted by the 15th of each month to the Head of SBU/Line Manager for recommendation and then to the HR/Admin Department for verification before final approval from the Group CEO."
  },
  {
    "section": "salary",
    "chunk_id": "salary_0",
    "text": "Payment of salary is done on a monthly basis through the bank designated by the group."
  },
  {
    "section": "salary",
    "chunk_id": "salary_1",
    "text": "For income tax, the Group will make income tax deductions according to the latest tax schedule. Employees are responsible for settling their own salary tax liabilities unless otherwise specified."
  },
  {
    "section": "salary",
    "chunk_id": "salary_2",
    "text": "Salary rules for Employee Provident Fund (EPF): The Group contributes 12% of basic salary for all employees. An additional 3% is contributed for employees who have completed more than five years of continuous service."
  },
  {
    "section": "salary",
    "chunk_id": "salary_3",
    "text": "Social Security Contribution (SOCSO): The Group contributes to SOCSO as per the Employees' Social Security Organisation Act.  For the purposes of SOCSO contributions, “wages” are defined as payments made to employees, eg. salary and overtime payments."
  },
  {
    "section": "salary",
    "chunk_id": "salary_4",
    "text": "The policy for calculating annual increment and bonus payments is based on: the discretion of the group; annual performance appraisal; past performance improvement, dependability, attitude, cooperation, and disciplinary action taken; adherence to all Employment Policies; and the salary range of the employee's position."
  },
  {
    "section": "leave",
    "chunk_id": "public_holiday",
    "text": "Federal and State Public Holidays: Employees are entitled to paid holidays on all gazetted Federal and State Public Holidays in their state. If a public holiday falls on a Sunday, the next working day is a replacement holiday. Employees can leave one and a half hours early on the eve of Chinese New Year, Hari Raya Puasa, Hari Raya Haji, Wesak Day, Deepavali, and Christmas Day."
  },
  {
    "section": "leave",
    "chunk_id": "annual_leave",
    "text": "Annual Leave: For rest, relaxation, and personal matters. Entitlements are calculated on a calendar year basis. M3 and E1 and above: Less than 2 years of service: 18 days; Between 2-5 years of service: 18 days; More than 5 years of service: 24 days. E2 and below: Less than 2 years of service: 14 days; Between 2-5 years of service: 16 days; More than 5 years of service: 18 days."
  },
  {
    "section": "leave",
    "chunk_id": "annual_leave_carry_forward",
    "text": "Annual Leave Carry Forward: A confirmed employee who fails to take their leave by the end of the year shall be allowed to carry forward a maximum of five (5) days to the following year. All carried forward leave must be consumed within the first three (3) months of the year, otherwise it shall be forfeited."
  },
  {
    "section": "leave",
    "chunk_id": "leave_application",
    "text": "Leave application requires one (1) week advance notice, or two (2) weeks for leaves more than five (5) working days."
  },
  {
    "section": "leave",
    "chunk_id": "medical_leave",
    "text": "Medical and Hospitalisation Leave: Employees are entitled to paid medical leave based on the Employment Act, 1955, with a recommendation from a Registered Medical Practitioner. Paid Medical leave: Less than 2 years of service = 14 days; 2-5 years of service = 18 days; More than 5 years = 22 days."
  },
  {
    "section": "leave",
    "chunk_id": "maternity_leave",
    "text": "Maternity Leave: Female employees are entitled to a maximum of 60 consecutive days of maternity leave, which can be taken before and/or immediately after the day of delivery. To be eligible, she must have worked for ninety (90) days during the 9 months before confinement. Paid maternity leave is granted if conditions are met. Leave for a miscarriage prior to the 28th week is considered normal medical leave."
  },
  {
    "section": "leave",
    "chunk_id": "marriage_leave",
    "text": "Marriage Leave: Confirmed employees with at least one year of continuous service are entitled to three working days of paid marriage leave for their first legal marriage."
  },
  {
    "section": "leave",
    "chunk_id": "paternity_leave",
    "text": "Paternity Leave: Confirmed male employees with at least one year of continuous service are entitled to two working days of paternity leave for the birth of every child to their first legal wife, up to five deliveries. Documentary evidence (e.g., birth certificate) is required."
  },
  {
    "section": "leave",
    "chunk_id": "compassionate_leave",
    "text": "Compassionate Leave: Employees are eligible for two working days of compassionate leave for the death of a family member. The maximum number of compassionate leave days shall not exceed six (6) days per annum."
  },
  {
    "section": "leave",
    "chunk_id": "examination_leave",
    "text": "Examination and Study Leave: Employees are eligible for 3 working days of exam/study leave per subject for their first attempt while pursuing Group-approved courses."
  },
  {
    "section": "medical_benefits",
    "chunk_id": "medical_benefits_0",
    "text": "Outpatient and Specialist Medical and Dental Benefits: Medical and specialist benefits are provided to confirmed employees only. Medical Benefit: RM500 per calendar year / RM 50 per visit. "
  },
  {
    "section": "medical_benefits",
    "chunk_id":"medical_benefits_1",
    "text": "Dental Benefit: M1 and above: RM500 per calendar year; M3 and below: RM200 per calendar year. The coverage excludes dental treatment of a cosmetic nature."
  },
  {
    "section": "medical_benefits",
    "chunk_id": "medical_benefits_2",
    "text": "The Group implements a 'Healthy Mind' program as part of a holistic approach for mental health support particularly for  employee well-being, which includes access to counseling services, mindfulness training, and stress management workshops."
  },
  {
    "section": "medical_benefits",
    "chunk_id": "medical_benefits_3",
    "text": "Prolonged Illness: An employee diagnosed with a prolonged illness is entitled to: 1st - 3rd month: Full pay leave; 4th - 6th month: No pay leave. After six months, if still unfit to work, the Group reserves the right to terminate the employment on medical grounds."
  },
  {
    "section": "medical_benefits",
    "chunk_id": "medical_benefits_4",
    "text": "Group Insurance Coverage: The Group provides insurance coverage for confirmed employees. An employee shall be required to obtain a referral letter from a general practitioner to be eligible for the hospitalisation and surgical benefit coverage."
  },
  {
    "section": "incentives",
    "chunk_id": "incentives_0",
    "text": "Travelling and Petrol Allowance: The mileage claim rate for motorcars is RM0.90 (inclusive of toll and parking expenses)."
  },
  {
    "section": "incentives",
    "chunk_id": "incentives_1",
    "text": "Mobile Phone Allowance: The Group provides a mobile phone allowance for confirmed professional employees only, up to a maximum of RM50.00 per month."
  },
  {
    "section": "incentives",
    "chunk_id": "incentives_3",
    "text": "Long Service Awards: Rewarded for committed and loyal employees. Periods of No Pay Leave shall not be counted towards the continuous service period.  The eligibility for long service awards for employees who have  completed the requisite period of continuous service with disciplinary records shall be at the sole discretion of the Group.  "
  },
  {
    "section": "incentives",
    "chunk_id": "incentives_4",
    "text": "Recreational Membership Benefit: Core Team members are eligible for one of three types of memberships: Golf Club, Non-Golf Club, or Gym/Beauty. The gym/beauty membership benefit is a one-off gym  membership fee subsidy or beauty package fee subsidy of the actual fee or up to a maximum of RM2,000 per eligible employee, whichever is lower  "
  },
  {
    "section": "incentives",
    "chunk_id": "incentives_5",
    "text": "Company Trip Subsidy: The Group encourages employees to attend company trips. Confirmed employees will be provided with assistance in the form of a financial subsidy or an interest-free loan for the trip, based on their job grade."
  },
  {
    "section": "incentives",
    "chunk_id": "incentives_6",
    "text": "Education Assistance Programme (EAP): A confirmed employee who has completed at least two (2) years of continuous service is eligible. The subsidy limit per programme is: Core Team: RM40,000; Non-core Team: RM30,000. A maximum of two (2) EAP subsidies shall be awarded per calendar year."
  },
  {
    "section": "incentives",
    "chunk_id": "incentives_7",
    "text": "Commitment Incentive: A confirmed employee who has perfect attendance (does not use any medical or emergency days off) and has been punctual is eligible for a cash reward. This incentive is paid within two (2) months after the assessment period."
  },
  {
    "section": "incentives",
    "chunk_id": "incentives_8",
    "text": "All employees shall be eligible to attend approved training programmes and/or preferred training programmes up to a maximum of forty (40) training hours (including internal training) except those who are serving their notice period as a result of resignation/domestic inquiries. A Training Needs Analysis shall be conducted annually to determine the training and development requirements of the employees. The employee shall fill in the Training Evaluation Form and submit it to the HR/Admin Department within two (2) working days for monitoring, review and record and provide a copy of the Training Nomination Form to the HR/Admin Department for filing in the employee’s personal file for monitoring and record"
  },
  {
    "section": "performance",
    "chunk_id": "performance_0",
    "text": "Performance Appraisal: The Group has a performance appraisal system to ensure all employees perform at their best. All employees are given Key Performance Indicators (KPIs). Appraisals are conducted at least once a year by the Head of SBU/Line Manager."
  },
  {
    "section": "performance",
    "chunk_id": "performance_1",
    "text": "Performance Interview: The purpose is to discuss job performance during the previous cycle, plan for future performance objectives, and ensure careful planning and preparation by both the manager and employee."
  },
  {
    "section": "transfer_promotion",
    "chunk_id": "transfer_promotion_0",
    "text": "The Group can transfer or second an employee within any section, department, or division based on its operational needs. "
  },
  {
    "section": "transfer_promotion",
    "chunk_id": "transfer_promotion_1",
    "text": "Employees that are promoted must serve a 6-month probation period.  In the event where the employee is unable to perform and meet the higher responsibility and expectations satisfactorily and thus not confirmed in his new position, he shall be reverted to his former position and withdraw his acting allowance without prejudice to his future prospect within the Group. "
  },
  {
    "section": "transfer_promotion",
    "chunk_id": "transfer_promotion_2",
    "text": "Promotions are based on an employee's annual performance appraisal, demonstrated leadership skills, and readiness to take on increased responsibilities. Employees must consistently exceed expectations in their Key Performance Indicators (KPIs) to be considered for promotion."
  },
  {
    "section": "rules_regulations",
    "chunk_id": "rules_regulations_0",
    "text": "Grounds for Disciplinary Action: Examples of major misconducts include: Disclosing confidential information without authorisation; Habitual absence without leave, or absence for more than three (3) consecutive working days; Misappropriation of Group funds."
  },
  {
    "section": "rules_regulations",
    "chunk_id": "rules_regulations_1",
    "text": "Disciplinary Action: The Head of SBU may impose: Verbal warning; Written warning; Final written warning; Formal action (including suspension with/without pay, reduction of salary, dismissal with notice, or filing a legal suit)."
  },
  {
    "section": "leaving",
    "chunk_id": "leaving_0",
    "text": "Termination Procedure: Either party may terminate the contract with a written notice or payment in lieu. Upon termination, the employee must surrender all Group property and settle any liabilities. An employee is eligible to receive all unused accrued leave if they have complied with all exit procedures."
  },
  {
    "section": "leaving",
    "chunk_id": "leaving_1",
    "text": "Termination Notice Period: During Probation: 1 month. Upon Confirmation: M3 and above: 3 months; E1: 2 months; E2 and below: 1 month."
  },
  {
    "section": "leaving",
    "chunk_id": "leaving_2",
    "text": "An employee who has resigned shall not be eligible for re-hiring for three (3) years from his resignation except with the approval from the Senior Partner/Group CEO."
  },
  {
    "section": "leaving",
    "chunk_id": "leaving_3",
    "text": "Job Abandonment: An employee that abandons their job will be terminated immediately and is not eligible for rehire."
  },
  {
    "section": "leaving",
    "chunk_id": "leaving_4",
    "text": "Retirement: The official age for retirement is 55 years old."
  },
  {
    "section": "leaving",
    "chunk_id": "leaving_5",
    "text": "Exit Interview: When an employee leaves the company, they may be asked to attend an exit interview with the Head of SBU."
  }
]