[
  {
    "section": "employment_contract",
    "pdf_path": "pdfs/employment_contract.pdf",
    "display_name": "📝 Employment Contract",
    "text": "Appointment:\nFor every new employee, they will receive an appointment letter from the HR department before starting their duties.\n\nEmployee Personal Information:\nEmployees should provide updated personal information for record purposes.\n\nPre-employment medical check-up:\nAll new employees must undergo a medical check-up before the letter of employment is issued.\n\nOrientation Program:\nonducted by the HR Department for all new employees to help them understand the Group's policies and benefit\n\nDepartmental Orientation:\nConducted by the Head of SBU for the new Employee\n\nProbation and Confirmation:\n- All permanent employees are required to serve a 6-month probation period from the date of appointment.\n- Probationary period may be extended for up to another 6months if the performance does not meet the Group's standards\n- The Group can terminate an employee if they do not fulfull expectations during or end of probation period."
  },
  {
    "section": "incentives",
    "pdf_path": "pdfs/incentives.pdf",
    "display_name":"🎁 Incentives and Rewards",
    "text": "Travelling Claims:\nReimbursement of Travelling Claims and Petrol Allowance:\n\nPetrol allowance:\nThe mileage claim rate for motorcars is \nRM0.90 (inclusive of toll and parking expenses).\n\nMobile Phone Allowance:\nThe company provides mobile phone allowance: The Group provides a mobile phone allowance for confirmed professional employees only.\nEmployees can claim up to a maximum of RM50.00 per month.\nEntertainment Claims: For entertainment claims, only employees of job grade M1 and above are entitled to entertainment claims for Group business purposes.\n\nLong Service Awards:\nRewarded for committed and loyal employees.\nPeriods of No Pay Leave shall not be counted towards the continuous\nservice period.\n\nRecreational Membership Benefit: \nCore Team members are eligible for one of three types of memberships: Golf Club, Non-Golf Club, or Gym/Beauty.\n\nCompany trip subsidy: \nThe Group encourages employees to attend company trips to build teamwork and bonding. \nConfirmed employees will be provided with assistance in the form of a financial subsidy or an interest-free loan for the trip, based on their job grade.\n\nExamination Fees:\nThe Group supports the continuous development of employees and encourages them to pursue professional qualifications under the Group's employment.\n\nEducation Assistance Programme:\nA confirmed employee who has completed at least two (2) years of\ncontinuous service with the Group shall be eligible to apply for the EAP.\nThe limit of the EAP subsidy per employee per programme\nshall be as follows: \n- Core Team: 40,000\n- Non-core Team: 30,000\n\nA maximum of two (2) EAP subsidy awards shall be awarded per calendar year.\n\nCommitment Incentive:\nA confirmed employees who does not utilise any of his medical leave and/or emergency leave entitlement within the relevant assessment\nperiod shall be eligible for the following commitment incentive, provided\nthey have been punctual during the relevant assessment period:\n- Medical Leave: RM300\n- Emergency Leave: RM300\n- Medical and Emergency Leave: RM1,000\n\nThe disbursement of the commitment incentive shall be paid within two\n(2) months immediately after the end of each assessment period."
  },
  {
    "section": "introduction",
    "pdf_path": "pdfs/vision_mission.pdf",
    "display_name": "🏢 Vision and Mission",
    "text": "Vision: To be a highly reliable regional professional firm. , Committed to improving the quality of life of its employees\nand provide a full range of high-quality, value-added services, delivered by the best and most practical people.\n\nMission:\n- To be the best company to work for, where employees are treated as part of a big family\n- To leverage technology and the UHY international brand to improve the gross margin\n- To venture into financial services to enhance the Group's income stream."
  },
  {
    "section": "leave",
    "pdf_path": "pdfs/leave.pdf",
    "display_name": "🌴 Leave Policy",
    "text": "Section: Leave\n\nFederal and State Public Holidays:\nEmployees are entitled to paid holidays on all gazetted Federal and State Public Holidays in their state.\nIf a public holiday falls on a Sunday, the next working day is a replacement holiday.\nEmployees can leave one and a half hours early on the eve of Chinese New Year, Hari Raya Puasa, Hari Raya Haji, Wesak Day, Deepavali, and Christmas Day.\n\nAnnual leave:\nFor rest, relaxation, and personal matters. Entitlements are calculated on a calendar year basis.\n\nAnnual Leave Entitlements per Calendar Year:\nM3 and E1 and above are: \n1. Less than 2 years of service: 18 days.\n2. Between 2-5 years of service: 18 days.\n3. More than 5 years of service: 24 days. \n\nFor E2 and below: \nLess than 2 years of service: 14 days\nBetween 2-5 years of service: 16 days\nMore than 5 years of service: 18 days.\n\nA confirmed employee who has not completed a full year of service by December 31st will receive a proportionate amount of annual leave.\n\nAn employee who fails to take such leave at the end of each calendar year shall be allowed to carry forward a maximum of five (5) days of\nsuch annual leave to the following year. \n\nAll leaves carried forward mustbe consumed within the first three (3) months of the year to which it is carried forward otherwise it shall be forfeited.\n\nAn employee shall apply for his annual leave one (1) week in advance.\nWhere the application for leave is more than five (5) working days, employees shall apply for approval two (2) weeks in advance\n\nMedical and hospitalisation leave:\nEmployees are entitled to paid medical leave based on the Employment Act, 1955.\nMedical leave is granted with a recommendation from a Registered Medical Practitioner and a supporting medical certificate.\nPaid Medical leave:\n- Less 2 years of service = 14 days\n- 2-5 years of service = 18 days\n- More than 5 years = 22 days\n\nMaternity leave:\n-Female employees are entitled to a maximum of 60 consecutive days of maternity leave.\n-Leave can be taken before and/or immediately after the day of delivery.\n-Leave on account of miscarriage prior to the 28th week of pregnancy\nshall not be considered as maternity leave but as normal medical leave.\n- A female employee shall be entitled to paid maternity leave if:\n    - She has worked for a continuous period of ninety (90) days\n    during the nine (9) months period before the day of the confinement and;\n    - She is an employee at any time during the four (4) months before\n    the confinement.\n- The maternity leave may be taken on, before and/or immediately after\nthe day of delivery.\n- The employee shall apply for maternity leave not less than four (4)\nweeks prior commencement of the intended maternity leave period.\n- During the maternity leave, the employee shall be paid in the normal\nmanner.\n\n\nMarriage leave:\nConfirmed employees with at least one year of continuous service are entitled to three working days of paid marriage leave for their first legal marriage.\n\nPaternity leave:\nConfirmed male employees with at least one year of continuous service are entitled to two working days of paternity leave for the birth of every child to their first legal wife, up to five deliveries.\nThe employee shall be required to produce documentary evidence (eg. birth certificate) in support of his application.\n\nCompassionate leave: \nEmployees are eligible for two working days of compassionate leave for the death of a family member.\nThe maximum number of compassionate leave days shall not exceed six (6) days per annum.\n\nExamination and study leave:\nEmployees are eligible for 3 working days of exam/study leave per subject for their first attempt while pursuing Group-approved courses."
  },
  {
    "section": "leaving",
    "pdf_path": "pdfs/leaving_company.pdf",
    "display_name":"🚪 Leaving the Company",
    "text": "Section: Leaving the company\n\nTermination procedure: \nAn employee can be terminated by the Group or can terminate their service by giving written notice or payment in lieu of notice.\n\nUpon termination, the employee must surrender all Group property and settle any liabilities.\n\nAn employee is eligible to receive all unused accrued leave for the calendar year if they have complied with all exit procedures.\n\nTermination of Employment:\n\n- Either party may terminate the contract with a written notice or payment in lieu.\n- The termination notice period is based on the following:\n    - During Probation: 1 month.\n    - M3 and above: 2 weeks.\n    - E1 and below: 3 months.\n    - Upon Confirmation: \n        - M3 and above: 3 month notice period\n        - E1: 2 month notice period\n        - E2 and below: 1 month.\n\n- The employee who has resigned from the Group shall not be eligible for re-hiring three (3) years from his resignation except with the approval from the Senior Partner/Group CEO.\n\nJob abandonment:\nEmployee that abandons job will be terminated immediately, and not eligible for rehire.\n\nRetirement:\nWhen employee reaches the official age for retirement at 55 years old on their birthday\n\nExit Interview:\n When an employee leaves the company, they may be asked to attend an \"exit interview\" with the Head of SBU"
  },
  {
    "section": "medical_benefits",
    "pdf_path": "pdfs/medical_benefits.pdf",
    "display_name": "🏥 Medical Benefits",
    "text": "Section: Medical Benefits\n\nOutpatient and Specialist Medical and Dental Benefits:\nMedical and specialist benefits are provided to confirmed employees only.\n\nMedical Benefit:\nRM500 per calendar/RM 50 per visit\n\nDental Benefit:\nM1 and above: RM500 per calendar year.\nM3 and below: RM200 per calendar year.\n\nDental Benefit Information: \nThe coverage of dental treatment shall exclude dental treatment of cosmetic nature.\n\nProlonged Illness: An employee diagnosed with a prolonged illness during their employment is entitled to provisions for the subsequent six months as follows:\n1st - 3rd month: Full pay leave.\n4th - 6th month: No pay leave.\n\nAt the end of the six (6) months period, if the employee is still certified\nunfit to work by a Registered Medical Practitioner, the Group shall\nreserve the right to terminate the employment on medical grounds.\n\nGroup Insurance Coverage: \nThe Group provides insurance coverage for confirmed employees.\nAn employee shall be required to obtain a referral letter from a general practitioner to be eligible for the hospitalisation and surgical benefit coverage.\n\nAccident:\nIn the event of an accident, an employee or his next of kin shall\nimmediately inform the Head of SBU/Line Manager or the Admin\nDepartment in the event of any accident, where possible."
  },
  {
    "section": "overtime",
    "pdf_path": "pdfs/overtime_timeoff.pdf",
    "display_name": "⏰ Overtime & Time-Off",
    "text": "Section: Overtime & Time-Off Lieu\n\nFor overtime employees with a salary of RM1,500.00 or less per month are entitled to claim overtime allowance.\nThe overtime rate is one and a half (1 1/2) times the hourly pay.\n\nFor the first hour, payment is calculated in units of 30 minutes, rounded to the nearest 30 minutes.\n\nTime-Off-In-Lieu:\nApplicable to employees earning RM1,501.00 and above.\n\nGeneral claim processes:\nEmployees can claim a meal allowance if they meet the overtime work conditions.\nOvertime claims must be submitted by the 15th of each month to the Head of SBU/Line Manager for recommendation and then to the HR/Admin Department for verification before final approval from the Group CEO."
  },
  {
    "section": "performance",
    "pdf_path": "pdfs/performance_management.pdf",
    "display_name": "📊 Performance Management",
    "text": "Section: Performance Management System\n\nPerformance Appraisal:\nThe Group has a performance appraisal system to ensure all employees perform at their best. \n\nThe system recognizes good performance and provides suggestions for improvement.\n\nAll employees are given Key Performance Indicators (KPIs) with detailed requirements and expectations.\n\nPerformance is evaluated via a performance appraisal. Appraisals are conducted at least once a year by the Head of SBU/Line Manager.\n\nPerformance Interview:\n- The purpose of performance evaluation meeting is to:\n    - Provide the Head of SBU/Line Manager and the employee an opportunity to discuss job performance during the previous performance cycle.\n    - Plan for future performance objectives.\n    - Ensure the evaluation meeting is a careful planning and preparation part of the Head of SBU/Line Managers and employee."
  },
  {
    "section": "rules_regulations",
    "pdf_path": "pdfs/rules_regulations.pdf",
    "display_name": "⚖️ Rules & Regulations",
    "text": "Section: Rules and Regulations\n\nGrounds for Disciplinary Action:\nExamples of major misconducts:\n- Disclosing any confidential information, including\nconfidential information of the Group’s clients to third parties\nwithout proper authorisation\n- Habitual absence without leave, or absence without leave for\nmore than three (3) consecutive working days.\n- Misappropriation of Group funds.\n\nDisciplinary Action:\nThe Head of SBU or immediate superior may impose any one or\ncombination of the following disciplinary action against an employee: -\n1. Verbal warning;\n2. Written warning;\n3. Final written warning;\n4. Formal action, which will include but is not limited to:-\n    - suspension with or without pay for a period of time;\n    - Reduction of salary\n    - Dismissal with contractual notice; and\n    - Filing a legal suit against employee."
  },
  {
    "section": "salary",
    "pdf_path": "pdfs/salary.pdf",
    "display_name": "💰 Salary",
    "text": "Section: Salary\n\nPayment of salary is done on monthly basis, payments are made through the bank designated by the group\n\nFor income tax, The Group will make income tax deductions according to the latest tax schedule. \nEmployees are responsible for settling their own salary tax liabilities unless otherwise specified.\n\nEmployee Provident Fund (EPF): The Group contributes 12% of basic salary for all employees.\nAn additional 3% is contributed for employees who have completed more than five years of continuous service.\nSocial Security Contribution (SOCSO): The Group contributes to SOCSO as per the Employees' Social Security Organisation Act.\n\nAnnual increment and bonus payments are based on: \n- discretion of the group\n- annual performance appraisal\n- past performance improvement, dependability, attitude, cooperation, and disciplinary action taken\n- adherence to all Employment Policies\n- salary range of the employee's position."
  },
  {
    "section": "transfer_promotion",
    "pdf_path": "pdfs/transfer_promotion.pdf",
    "display_name": "📦 Transfers & Promotions",
    "text": "For transfer And secondment, the Group can transfer or second an employee within any section, department, or division based on its operational needs.\n\nPromotion happens where employees that are promoted must serve a 6-month probation period. \n  In the event where the employee is unable to perform and meet the higher responsibility and expectations satisfactorily and thus not confirmed in his new position, he shall be reverted to his former position and withdraw his acting allowance without prejudice to his future prospect within the Group "
  },
  {
    "section": "work_hours",
    "pdf_path": "pdfs/working_hours.pdf",
    "display_name": "🕒 Working Hours",
    "text": "Normal working hours is Monday to Friday, 8:30 am to 5:30 pm \n\nLunch break is from 1.00pm to 2.00pm"
  }
]